extends Node


# ============================================================
# ТЕКУЩИЙ ДРАФТ
# ============================================================

var current_draft_team: Array[PlayerCard] = []


# ============================================================
# ВЫБРАННАЯ СХЕМА ДРАФТА
# ============================================================

var current_formation: Dictionary = {}


# ============================================================
# ОЧИСТКА ТЕКУЩЕГО ДРАФТА
# ============================================================

func clear_draft() -> void:

	current_draft_team.clear()

	current_formation.clear()


# ============================================================
# УСТАНОВИТЬ СХЕМУ
# ============================================================

func set_formation(
	formation_data: Dictionary
) -> void:

	current_formation = formation_data.duplicate(true)


# ============================================================
# ПОЛУЧИТЬ СХЕМУ
# ============================================================

func get_formation() -> Dictionary:

	return current_formation